## Устанавливаем необходимые библиотеки SQL для работы в JN

Устанавливаем MySQL https://dev.mysql.com/downloads/installer/

Устанавливаем необходимые библиотеки:

In [1]:
# !pip install pymysql  # не надо
# !pip install ipython-sql
# !pip install mysqlclient
# !pip install mysql-connector-python  # не надо
# !pip install sqlalchemy

### Создаем базу «Абитуриент»

В MySQL создаем схему test (удаляем все таблицы):
```mysql
DROP SCHEMA IF EXISTS enrollee;
CREATE DATABASE enrollee;
USE enrollee;
```

Устанавливаем соединениес MySQL:

In [1]:
import sqlalchemy

In [2]:
sqlalchemy.create_engine("mysql://root:123qwe@localhost/enrollee")

Engine(mysql://root:***@localhost/enrollee)

In [3]:
%load_ext sql

In [4]:
%sql mysql://root:123qwe@localhost/enrollee

### Структура и наполнение таблиц

In [5]:
%%sql
DROP TABLE IF EXISTS enrollee_subject;
DROP TABLE IF EXISTS program_enrollee;
DROP TABLE IF EXISTS program_subject;
DROP TABLE IF EXISTS enrollee_achievement;
DROP TABLE IF EXISTS achievement;
DROP TABLE IF EXISTS enrollee;
DROP TABLE IF EXISTS program;
DROP TABLE IF EXISTS subject;
DROP TABLE IF EXISTS department;

 * mysql://root:***@localhost/enrollee
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [6]:
%%sql
CREATE TABLE department (
    department_id   INT PRIMARY KEY AUTO_INCREMENT,
    name_department VARCHAR(30)
);

INSERT INTO department (department_id, name_department)
VALUES
    (1, 'Инженерная школа'),
    (2, 'Школа естественных наук');

SELECT * FROM department;

 * mysql://root:***@localhost/enrollee
0 rows affected.
2 rows affected.
2 rows affected.

[(1, 'Инженерная школа'), (2, 'Школа естественных наук')]

In [7]:
%%sql
CREATE TABLE subject (
    subject_id   INT PRIMARY KEY AUTO_INCREMENT,
    name_subject VARCHAR(30)
);

INSERT INTO subject (subject_id, name_subject)
VALUES
    (1, 'Русский язык'),
    (2, 'Математика'),
    (3, 'Физика'),
    (4, 'Информатика');

SELECT * FROM subject;

 * mysql://root:***@localhost/enrollee
0 rows affected.
4 rows affected.
4 rows affected.

[(1, 'Русский язык'), (2, 'Математика'), (3, 'Физика'), (4, 'Информатика')]

In [8]:
%%sql
CREATE TABLE program (
    program_id    INT PRIMARY KEY AUTO_INCREMENT,
    name_program  VARCHAR(50),
    department_id INT,
    plan          INT,
    FOREIGN KEY (department_id) REFERENCES department(department_id) ON DELETE CASCADE
);

INSERT INTO program (program_id, name_program, department_id, plan)
VALUES
    (1, 'Прикладная математика и информатика', 2, 2),
    (2, 'Математика и компьютерные науки', 2, 1),
    (3, 'Прикладная механика', 1, 2),
    (4, 'Мехатроника и робототехника', 1, 3);

SELECT * FROM program;

 * mysql://root:***@localhost/enrollee
0 rows affected.
4 rows affected.
4 rows affected.

[(1, 'Прикладная математика и информатика', 2, 2),
 (2, 'Математика и компьютерные науки', 2, 1),
 (3, 'Прикладная механика', 1, 2),
 (4, 'Мехатроника и робототехника', 1, 3)]

In [9]:
%%sql
CREATE TABLE enrollee (
    enrollee_id   INT PRIMARY KEY AUTO_INCREMENT,
    name_enrollee VARCHAR(50)
);

INSERT INTO enrollee (enrollee_id, name_enrollee)
VALUES
    (1, 'Баранов Павел'),
    (2, 'Абрамова Катя'),
    (3, 'Семенов Иван'),
    (4, 'Яковлева Галина'),
    (5, 'Попов Илья'),
    (6, 'Степанова Дарья');

SELECT * FROM enrollee;

 * mysql://root:***@localhost/enrollee
0 rows affected.
6 rows affected.
6 rows affected.

[(1, 'Баранов Павел'),
 (2, 'Абрамова Катя'),
 (3, 'Семенов Иван'),
 (4, 'Яковлева Галина'),
 (5, 'Попов Илья'),
 (6, 'Степанова Дарья')]

In [10]:
%%sql
CREATE TABLE achievement (
    achievement_id   INT PRIMARY KEY AUTO_INCREMENT,
    name_achievement VARCHAR(30),
    bonus            INT
);

INSERT INTO achievement (achievement_id, name_achievement, bonus)
VALUES
    (1, 'Золотая медаль', 5),
    (2, 'Серебряная медаль', 3),
    (3, 'Золотой значок ГТО', 3),
    (4, 'Серебряный значок ГТО', 1);

SELECT * FROM achievement;

 * mysql://root:***@localhost/enrollee
0 rows affected.
4 rows affected.
4 rows affected.

[(1, 'Золотая медаль', 5),
 (2, 'Серебряная медаль', 3),
 (3, 'Золотой значок ГТО', 3),
 (4, 'Серебряный значок ГТО', 1)]

In [11]:
%%sql
CREATE TABLE enrollee_achievement (
    enrollee_achiev_id INT PRIMARY KEY AUTO_INCREMENT,
    enrollee_id        INT,
    achievement_id     INT,
    FOREIGN KEY (enrollee_id) REFERENCES enrollee(enrollee_id) ON DELETE CASCADE,
    FOREIGN KEY (achievement_id) REFERENCES achievement(achievement_id) ON DELETE CASCADE
);

INSERT INTO enrollee_achievement (enrollee_achiev_id, enrollee_id, achievement_id)
VALUES
    (1, 1, 2),
    (2, 1, 3),
    (3, 3, 1),
    (4, 4, 4),
    (5, 5, 1),
    (6, 5, 3);

SELECT * FROM enrollee_achievement;

 * mysql://root:***@localhost/enrollee
0 rows affected.
6 rows affected.
6 rows affected.

[(1, 1, 2), (2, 1, 3), (3, 3, 1), (4, 4, 4), (5, 5, 1), (6, 5, 3)]

In [12]:
%%sql
CREATE TABLE program_subject (
    program_subject_id INT PRIMARY KEY AUTO_INCREMENT,
    program_id         INT,
    subject_id         INT,
    min_result         INT,
    FOREIGN KEY (program_id) REFERENCES program(program_id) ON DELETE CASCADE,
    FOREIGN KEY (subject_id) REFERENCES subject(subject_id) ON DELETE CASCADE
);

INSERT INTO program_subject (program_subject_id, program_id, subject_id, min_result)
VALUES
    (1, 1, 1, 40),
    (2, 1, 2, 50),
    (3, 1, 4, 60),
    (4, 2, 1, 30),
    (5, 2, 2, 50),
    (6, 2, 4, 60),
    (7, 3, 1, 30),
    (8, 3, 2, 45),
    (9, 3, 3, 45),
    (10, 4, 1, 40),
    (11, 4, 2, 45),
    (12, 4, 3, 45);

SELECT * FROM program_subject;

 * mysql://root:***@localhost/enrollee
0 rows affected.
12 rows affected.
12 rows affected.

[(1, 1, 1, 40),
 (2, 1, 2, 50),
 (3, 1, 4, 60),
 (4, 2, 1, 30),
 (5, 2, 2, 50),
 (6, 2, 4, 60),
 (7, 3, 1, 30),
 (8, 3, 2, 45),
 (9, 3, 3, 45),
 (10, 4, 1, 40),
 (11, 4, 2, 45),
 (12, 4, 3, 45)]

In [13]:
%%sql
CREATE TABLE program_enrollee (
    program_enrollee_id INT PRIMARY KEY AUTO_INCREMENT,
    program_id          INT,
    enrollee_id         INT,
    FOREIGN KEY (program_id) REFERENCES program(program_id) ON DELETE CASCADE,
    FOREIGN KEY (enrollee_id) REFERENCES enrollee(enrollee_id) ON DELETE CASCADE
);

INSERT INTO program_enrollee (program_enrollee_id, program_id, enrollee_id)
VALUES
    (1, 3, 1),
    (2, 4, 1),
    (3, 1, 1),
    (4, 2, 2),
    (5, 1, 2),
    (6, 1, 3),
    (7, 2, 3),
    (8, 4, 3),
    (9, 3, 4),
    (10, 3, 5),
    (11, 4, 5),
    (12, 2, 6),
    (13, 3, 6),
    (14, 4, 6);

SELECT * FROM program_enrollee;

 * mysql://root:***@localhost/enrollee
0 rows affected.
14 rows affected.
14 rows affected.

[(1, 3, 1),
 (2, 4, 1),
 (3, 1, 1),
 (4, 2, 2),
 (5, 1, 2),
 (6, 1, 3),
 (7, 2, 3),
 (8, 4, 3),
 (9, 3, 4),
 (10, 3, 5),
 (11, 4, 5),
 (12, 2, 6),
 (13, 3, 6),
 (14, 4, 6)]

In [14]:
%%sql
CREATE TABLE enrollee_subject (
    enrollee_subject_id INT PRIMARY KEY AUTO_INCREMENT,
    enrollee_id         INT,
    subject_id          INT,
    result              INT,
    FOREIGN KEY (enrollee_id) REFERENCES enrollee(enrollee_id) ON DELETE CASCADE,
    FOREIGN KEY (subject_id) REFERENCES subject(subject_id) ON DELETE CASCADE
);

INSERT INTO enrollee_subject (enrollee_subject_id, enrollee_id, subject_id, result)
VALUES
    (1, 1, 1, 68),
    (2, 1, 2, 70),
    (3, 1, 3, 41),
    (4, 1, 4, 75),
    (5, 2, 1, 75),
    (6, 2, 2, 70),
    (7, 2, 4, 81),
    (8, 3, 1, 85),
    (9, 3, 2, 67),
    (10, 3, 3, 90),
    (11, 3, 4, 78),
    (12, 4, 1, 82),
    (13, 4, 2, 86),
    (14, 4, 3, 70),
    (15, 5, 1, 65),
    (16, 5, 2, 67),
    (17, 5, 3, 60),
    (18, 6, 1, 90),
    (19, 6, 2, 92),
    (20, 6, 3, 88),
    (21, 6, 4, 94);

SELECT * FROM enrollee_subject;

 * mysql://root:***@localhost/enrollee
0 rows affected.
21 rows affected.
21 rows affected.

[(1, 1, 1, 68),
 (2, 1, 2, 70),
 (3, 1, 3, 41),
 (4, 1, 4, 75),
 (5, 2, 1, 75),
 (6, 2, 2, 70),
 (7, 2, 4, 81),
 (8, 3, 1, 85),
 (9, 3, 2, 67),
 (10, 3, 3, 90),
 (11, 3, 4, 78),
 (12, 4, 1, 82),
 (13, 4, 2, 86),
 (14, 4, 3, 70),
 (15, 5, 1, 65),
 (16, 5, 2, 67),
 (17, 5, 3, 60),
 (18, 6, 1, 90),
 (19, 6, 2, 92),
 (20, 6, 3, 88),
 (21, 6, 4, 94)]

## 3.3.2 Задание

Вывести абитуриентов, которые хотят поступать на образовательную программу «Мехатроника и робототехника» в отсортированном по фамилиям виде.

In [15]:
%%sql
SELECT
    name_enrollee
FROM
    enrollee
    JOIN program_enrollee USING(enrollee_id)
    JOIN program USING(program_id)
WHERE
    name_program = 'Мехатроника и робототехника'
ORDER BY
    name_enrollee ASC;

 * mysql://root:***@localhost/enrollee
4 rows affected.

[('Баранов Павел',), ('Попов Илья',), ('Семенов Иван',), ('Степанова Дарья',)]

## 3.3.3 Задание

Вывести образовательные программы, на которые для поступления необходим предмет «Информатика». Программы отсортировать в обратном алфавитном порядке.

In [16]:
%%sql
SELECT
    name_program
FROM
    subject
    JOIN program_subject USING(subject_id)
    JOIN program USING(program_id)
WHERE
    name_subject = 'Информатика'
ORDER BY
    name_program DESC;

 * mysql://root:***@localhost/enrollee
2 rows affected.

[('Прикладная математика и информатика',),
 ('Математика и компьютерные науки',)]

## 3.3.4 Задание

Выведите количество абитуриентов, сдавших ЕГЭ по каждому предмету, максимальное, минимальное и среднее значение баллов по предмету ЕГЭ. Вычисляемые столбцы назвать **Количество, Максимум, Минимум, Среднее**. Информацию отсортировать по названию предмета в алфавитном порядке, среднее значение округлить до одного знака после запятой.

In [17]:
%%sql
SELECT
    name_subject,
    COUNT(name_subject) AS Количество,
    MAX(result) AS Максимум,
    MIN(result) AS Минимум,
    ROUND(AVG(result), 1) AS Среднее
FROM
    subject
    JOIN enrollee_subject USING(subject_id)
GROUP BY
    name_subject
ORDER BY
    name_subject ASC;

 * mysql://root:***@localhost/enrollee
4 rows affected.

[('Информатика', 4, 94, 75, Decimal('82.0')),
 ('Математика', 6, 92, 67, Decimal('75.3')),
 ('Русский язык', 6, 90, 65, Decimal('77.5')),
 ('Физика', 5, 90, 41, Decimal('69.8'))]

## 3.3.5 Задание

Вывести образовательные программы, для которых минимальный балл ЕГЭ по каждому предмету больше или равен 40 баллам. Программы вывести в отсортированном по алфавиту виде.

In [18]:
%%sql
SELECT
    name_program
FROM
    program_subject
    JOIN program USING(program_id)
GROUP BY
    name_program
HAVING
    MIN(min_result) >= 40
ORDER BY
    name_program ASC;

 * mysql://root:***@localhost/enrollee
2 rows affected.

[('Мехатроника и робототехника',), ('Прикладная математика и информатика',)]

## 3.3.6 Задание

Вывести образовательные программы, которые имеют самый большой план набора,  вместе с этой величиной.

In [19]:
%%sql
SELECT
    name_program,
    plan
FROM
    program
WHERE
    plan = (
        SELECT MAX(plan)
        FROM program);

 * mysql://root:***@localhost/enrollee
1 rows affected.

[('Мехатроника и робототехника', 3)]

## 3.3.7 Задание

Посчитать, сколько дополнительных баллов получит каждый абитуриент. Столбец с дополнительными баллами назвать **Бонус**. Информацию вывести в отсортированном по фамилиям виде.

In [20]:
%%sql
SELECT
    name_enrollee,
    IF(SUM(bonus) IS Null, 0, SUM(bonus)) AS Бонус
FROM
    achievement
    JOIN enrollee_achievement USING(achievement_id)
    RIGHT JOIN enrollee USING(enrollee_id)
GROUP BY
    name_enrollee
ORDER BY
    name_enrollee ASC;

 * mysql://root:***@localhost/enrollee
6 rows affected.

[('Абрамова Катя', Decimal('0')),
 ('Баранов Павел', Decimal('6')),
 ('Попов Илья', Decimal('8')),
 ('Семенов Иван', Decimal('5')),
 ('Степанова Дарья', Decimal('0')),
 ('Яковлева Галина', Decimal('1'))]

## 3.3.8 Задание

Выведите сколько человек подало заявление на каждую образовательную программу и конкурс на нее (число поданных заявлений деленное на количество мест по плану), округленный до 2-х знаков после запятой. В запросе вывести название факультета, к которому относится образовательная программа, название образовательной программы, план набора абитуриентов на образовательную программу (**plan**), количество поданных заявлений (**Количество**) и **Конкурс**. Информацию отсортировать в порядке убывания конкурса.  
**Пояснение**: После GROUP BY задаются ВСЕ столбцы, указанные после SELECT,  к которым не применяются групповые функции или выражения с групповыми функциями.

In [21]:
%%sql
SELECT
    name_department,
    name_program,
    plan,
    COUNT(program_id) AS Количество,
    ROUND(COUNT(program_id) / plan , 2) AS Конкурс
FROM
    department
    JOIN program USING(department_id)
    JOIN program_enrollee USING(program_id)
GROUP BY
    name_department,
    name_program,
    plan
ORDER BY
    Конкурс DESC;

 * mysql://root:***@localhost/enrollee
4 rows affected.

[('Школа естественных наук', 'Математика и компьютерные науки', 1, 3, Decimal('3.00')),
 ('Инженерная школа', 'Прикладная механика', 2, 4, Decimal('2.00')),
 ('Школа естественных наук', 'Прикладная математика и информатика', 2, 3, Decimal('1.50')),
 ('Инженерная школа', 'Мехатроника и робототехника', 3, 4, Decimal('1.33'))]

## 3.3.9 Задание

Вывести образовательные программы, на которые для поступления необходимы предмет «Информатика» и «Математика» в отсортированном по названию программ виде.  
**Пояснение**: Сначала отберите все  программы, для которых определены Математика или Информатика, а потом, сгруппировав результат, отберите те программы, у которых количество отобранных дисциплин ровно две.

In [22]:
%%sql
SELECT
    name_program
FROM
    subject
    JOIN program_subject USING(subject_id)
    JOIN program USING(program_id)
WHERE
    name_subject IN ('Информатика', 'Математика')
GROUP BY
    name_program
HAVING
    COUNT(name_subject) = 2
ORDER BY
    name_program ASC;

 * mysql://root:***@localhost/enrollee
2 rows affected.

[('Математика и компьютерные науки',),
 ('Прикладная математика и информатика',)]

## 3.3.10 Задание

Посчитать количество баллов каждого абитуриента на каждую образовательную программу, на которую он подал заявление, по результатам ЕГЭ. В результат включить название образовательной программы, фамилию и имя абитуриента, а также столбец с суммой баллов, который назвать **itog**. Информацию вывести в отсортированном сначала по образовательной программе, а потом по убыванию суммы баллов виде.  
**Пояснение**: При описании соединения таблиц можно использовать схему enrollee →program_enrollee→program →program_subject →subject →enrollee_subject. Следующей для соединения идет таблица enrollee , но она уже в списке есть. Поэтому для последнего соединения subject →enrollee_subject нужно использовать дополнительное условие связи между enrollee_subject и enrollee:  
subject.subject_id = enrollee_subject.subject_id  
and enrollee_subject.enrollee_id = enrollee.enrollee_id

In [23]:
%%sql
SELECT
    name_program,
    name_enrollee,
    SUM(result) AS itog
FROM
    enrollee
    JOIN program_enrollee USING(enrollee_id)
    JOIN program USING(program_id)
    JOIN program_subject USING(program_id)
    JOIN subject USING(subject_id)
    JOIN enrollee_subject
    ON subject.subject_id = enrollee_subject.subject_id AND
       enrollee_subject.enrollee_id = enrollee.enrollee_id
GROUP BY
    name_program,
    name_enrollee
ORDER BY
    name_program ASC,
    itog DESC;

 * mysql://root:***@localhost/enrollee
14 rows affected.

[('Математика и компьютерные науки', 'Степанова Дарья', Decimal('276')),
 ('Математика и компьютерные науки', 'Семенов Иван', Decimal('230')),
 ('Математика и компьютерные науки', 'Абрамова Катя', Decimal('226')),
 ('Мехатроника и робототехника', 'Степанова Дарья', Decimal('270')),
 ('Мехатроника и робототехника', 'Семенов Иван', Decimal('242')),
 ('Мехатроника и робототехника', 'Попов Илья', Decimal('192')),
 ('Мехатроника и робототехника', 'Баранов Павел', Decimal('179')),
 ('Прикладная математика и информатика', 'Семенов Иван', Decimal('230')),
 ('Прикладная математика и информатика', 'Абрамова Катя', Decimal('226')),
 ('Прикладная математика и информатика', 'Баранов Павел', Decimal('213')),
 ('Прикладная механика', 'Степанова Дарья', Decimal('270')),
 ('Прикладная механика', 'Яковлева Галина', Decimal('238')),
 ('Прикладная механика', 'Попов Илья', Decimal('192')),
 ('Прикладная механика', 'Баранов Павел', Decimal('179'))]

## 3.3.11 Задание

Вывести название образовательной программы и фамилию тех абитуриентов, которые подавали документы на эту образовательную программу, но не могут быть зачислены на нее. Эти абитуриенты имеют результат по одному или нескольким предметам ЕГЭ, необходимым для поступления на эту образовательную программу, меньше минимального балла. Информацию вывести в отсортированном сначала по программам, а потом по фамилиям абитуриентов виде.

Например, Баранов Павел по «Физике» набрал 41 балл, а  для образовательной программы «Прикладная механика» минимальный балл по этому предмету определен в 45 баллов. Следовательно, абитуриент на данную программу не может поступить.

In [24]:
%%sql
SELECT
    DISTINCT name_program,
    name_enrollee
FROM
    enrollee
    JOIN program_enrollee USING(enrollee_id)
    JOIN program USING(program_id)
    JOIN program_subject USING(program_id)
    JOIN subject USING(subject_id)
    JOIN enrollee_subject USING(subject_id, enrollee_id)
WHERE
    result < min_result
ORDER BY
    name_program ASC,
    name_enrollee ASC;

 * mysql://root:***@localhost/enrollee
2 rows affected.

[('Мехатроника и робототехника', 'Баранов Павел'),
 ('Прикладная механика', 'Баранов Павел')]

## 3.4.2 Задание

Создать вспомогательную таблицу **applicant**,  куда включить **id** образовательной программы, **id** абитуриента, сумму баллов абитуриентов (столбец **itog**) в отсортированном сначала по **id** образовательной программы, а потом по убыванию суммы баллов виде (использовать запрос из предыдущего урока).

In [5]:
%%sql
CREATE TABLE applicant AS
SELECT
    program.program_id,
    enrollee.enrollee_id,
    SUM(result) AS itog
FROM
    enrollee
    JOIN program_enrollee USING(enrollee_id)
    JOIN program USING(program_id)
    JOIN program_subject USING(program_id)
    JOIN subject USING(subject_id)
    JOIN enrollee_subject
    ON subject.subject_id = enrollee_subject.subject_id AND
       enrollee_subject.enrollee_id = enrollee.enrollee_id
GROUP BY
    program.program_id,
    enrollee.enrollee_id
ORDER BY
    program.program_id ASC,
    itog DESC;

SELECT * FROM applicant;

 * mysql://root:***@localhost/enrollee
14 rows affected.
14 rows affected.

[(1, 3, Decimal('230')),
 (1, 2, Decimal('226')),
 (1, 1, Decimal('213')),
 (2, 6, Decimal('276')),
 (2, 3, Decimal('230')),
 (2, 2, Decimal('226')),
 (3, 6, Decimal('270')),
 (3, 4, Decimal('238')),
 (3, 5, Decimal('192')),
 (3, 1, Decimal('179')),
 (4, 6, Decimal('270')),
 (4, 3, Decimal('242')),
 (4, 5, Decimal('192')),
 (4, 1, Decimal('179'))]

## 3.4.3 Задание

Из таблицы **applicant**, созданной на предыдущем шаге, удалить записи, если абитуриент на выбранную образовательную программу не набрал минимального балла хотя бы по одному предмету (использовать запрос из предыдущего урока).
**Пояснение**: Возможный вариант решения - использование **DELETE** совместно с **USING**.

In [6]:
%%sql
DELETE FROM applicant
USING
    applicant
    JOIN enrollee_subject USING(enrollee_id)
    JOIN program_subject USING(subject_id)
WHERE
    result <= min_result AND
    applicant.program_id = program_subject.program_id;

SELECT * FROM applicant;

 * mysql://root:***@localhost/enrollee
2 rows affected.
12 rows affected.

[(1, 3, Decimal('230')),
 (1, 2, Decimal('226')),
 (1, 1, Decimal('213')),
 (2, 6, Decimal('276')),
 (2, 3, Decimal('230')),
 (2, 2, Decimal('226')),
 (3, 6, Decimal('270')),
 (3, 4, Decimal('238')),
 (3, 5, Decimal('192')),
 (4, 6, Decimal('270')),
 (4, 3, Decimal('242')),
 (4, 5, Decimal('192'))]

## 3.4.4 Задание

Повысить итоговые баллы абитуриентов в таблице **applicant** на значения дополнительных баллов (использовать запрос из предыдущего урока).  
**Пояснение**:
1. В запросах на обновление можно использовать несколько связанных таблиц. Например, чтобы обновить поле itog таблицы applicant для записей, относящихся к образовательной программе «Прикладная механика», используется запрос:
```mysql
UPDATE 
    applicant
    INNER JOIN program ON applicant.program_id = program.program_id
SET itog = 2
WHERE name_program = "Прикладная механика";
```
2. В нашем случае вместо таблицы program можно использовать вложенный запрос, в котором посчитаны дополнительные баллы абитуриентов. А в качестве условия соединения таблиц после ключевого слова  ON указать, что id абитуриентов в таблице applicant и во вложенном запросе совпадают.

In [7]:
%%sql
UPDATE
    applicant
    JOIN (
        SELECT
            enrollee_id,
            IF(SUM(bonus) IS Null, 0, SUM(bonus)) AS Бонус
            FROM
                achievement
                JOIN enrollee_achievement USING(achievement_id)
                RIGHT JOIN enrollee USING(enrollee_id)
            GROUP BY
            enrollee_id) bonus
        USING(enrollee_id)
SET
    itog = itog + Бонус;

SELECT * FROM applicant;

 * mysql://root:***@localhost/enrollee
12 rows affected.
12 rows affected.

[(1, 3, Decimal('235')),
 (1, 2, Decimal('226')),
 (1, 1, Decimal('219')),
 (2, 6, Decimal('276')),
 (2, 3, Decimal('235')),
 (2, 2, Decimal('226')),
 (3, 6, Decimal('270')),
 (3, 4, Decimal('239')),
 (3, 5, Decimal('200')),
 (4, 6, Decimal('270')),
 (4, 3, Decimal('247')),
 (4, 5, Decimal('200'))]

## 3.4.5 Задание

Поскольку при добавлении дополнительных баллов, абитуриенты по каждой образовательной программе могут следовать не в порядке убывания суммарных баллов, необходимо создать новую таблицу **applicant_order** на основе таблицы **applicant**. При создании таблицы данные нужно отсортировать сначала по **id** образовательной программы, потом по убыванию итогового балла. А таблицу **applicant**, которая была создана как вспомогательная, необходимо удалить.

In [8]:
%%sql
CREATE TABLE applicant_order AS
SELECT
    program_id,
    enrollee_id,
    itog
FROM
    applicant
ORDER BY
    program_id ASC,
    itog DESC;

DROP TABLE applicant;

SELECT * FROM applicant_order;

 * mysql://root:***@localhost/enrollee
12 rows affected.
0 rows affected.
12 rows affected.

[(1, 3, Decimal('235')),
 (1, 2, Decimal('226')),
 (1, 1, Decimal('219')),
 (2, 6, Decimal('276')),
 (2, 3, Decimal('235')),
 (2, 2, Decimal('226')),
 (3, 6, Decimal('270')),
 (3, 4, Decimal('239')),
 (3, 5, Decimal('200')),
 (4, 6, Decimal('270')),
 (4, 3, Decimal('247')),
 (4, 5, Decimal('200'))]

## 3.4.6 Зачисление студентов. Задание

Включить в таблицу **applicant_order** новый столбец **str_id** целого типа , расположить его перед первым.

In [10]:
%%sql
ALTER TABLE
    applicant_order
ADD
    str_id INT FIRST;

SELECT * FROM applicant_order;

 * mysql://root:***@localhost/enrollee
0 rows affected.
12 rows affected.

[(None, 1, 3, Decimal('235')),
 (None, 1, 2, Decimal('226')),
 (None, 1, 1, Decimal('219')),
 (None, 2, 6, Decimal('276')),
 (None, 2, 3, Decimal('235')),
 (None, 2, 2, Decimal('226')),
 (None, 3, 6, Decimal('270')),
 (None, 3, 4, Decimal('239')),
 (None, 3, 5, Decimal('200')),
 (None, 4, 6, Decimal('270')),
 (None, 4, 3, Decimal('247')),
 (None, 4, 5, Decimal('200'))]

## 3.4.7 Нумерация строк. Задание

Занести в столбец **str_id** таблицы **applicant_order** нумерацию абитуриентов, которая начинается с 1 для каждой образовательной программы.
**Пояснение**: В запросе на обновление используйте вложенный запрос , в котором нумеруются записи таблицы **applicant_order** по образовательным программам. В качестве условия соединения таблицы и вложенного запроса после ключевого слова  указать, что **id** программ в таблице **applicant_order** и во вложенном запросе совпадают, а также **id** абитуриентов в таблице **applicant_order** и во вложенном запросе совпадают.
В **IF** можно делать операции над несколькими переменными, используя **AND**. То есть
```mysql
IF(логическое_выражение, выражение AND выражение, выражение)
```

In [11]:
%%sql
SET @num_pr := 0;
SET @row_num := 1;

UPDATE applicant_order
SET str_id = if(program_id = @num_pr, @row_num := @row_num + 1, @row_num := 1 AND @num_pr := program_id);

SELECT * FROM applicant_order;

 * mysql://root:***@localhost/enrollee
0 rows affected.
0 rows affected.
12 rows affected.
12 rows affected.

[(1, 1, 3, Decimal('235')),
 (2, 1, 2, Decimal('226')),
 (3, 1, 1, Decimal('219')),
 (1, 2, 6, Decimal('276')),
 (2, 2, 3, Decimal('235')),
 (3, 2, 2, Decimal('226')),
 (1, 3, 6, Decimal('270')),
 (2, 3, 4, Decimal('239')),
 (3, 3, 5, Decimal('200')),
 (1, 4, 6, Decimal('270')),
 (2, 4, 3, Decimal('247')),
 (3, 4, 5, Decimal('200'))]

## 3.4.8 Задание

Создать таблицу **student**,  в которую включить абитуриентов, которые могут быть рекомендованы к зачислению  в соответствии с планом набора. Информацию отсортировать сначала в алфавитном порядке по названию программ, а потом по убыванию итогового балла.  
**Пояснение**: На каждую образовательную программу может быть зачислено только обозначенное в плане число абитуриентов (например, **n**). Выбираются первые **n** абитуриентов, набравших наибольшее количество баллов. В **str_id** содержится нумерация (отсортированных по сумме баллов абитуриентов), начинающаяся с 1 для каждой образовательной программы. И соответственно, если по плану нужно зачислить n абитуриентов, то выбираются все абитуриенты, порядковый номер которых в **str_id** меньше или равен **n**.  
То есть в таблицу на каждую образовательную программу включить абитуриентов, значение **str_id** которых в таблице **applicant_order** меньше или равно плану.

In [12]:
%%sql
CREATE TABLE student AS
SELECT
    name_program,
    name_enrollee,
    itog
FROM
    enrollee
    JOIN applicant_order USING(enrollee_id)
    JOIN program USING(program_id)
WHERE
    str_id <= plan
ORDER BY
    name_program ASC,
    itog DESC;

SELECT * FROM student;

 * mysql://root:***@localhost/enrollee
8 rows affected.
8 rows affected.

[('Математика и компьютерные науки', 'Степанова Дарья', Decimal('276')),
 ('Мехатроника и робототехника', 'Степанова Дарья', Decimal('270')),
 ('Мехатроника и робототехника', 'Семенов Иван', Decimal('247')),
 ('Мехатроника и робототехника', 'Попов Илья', Decimal('200')),
 ('Прикладная математика и информатика', 'Семенов Иван', Decimal('235')),
 ('Прикладная математика и информатика', 'Абрамова Катя', Decimal('226')),
 ('Прикладная механика', 'Степанова Дарья', Decimal('270')),
 ('Прикладная механика', 'Яковлева Галина', Decimal('239'))]